ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC845-BRK/LPC845-WorldClock/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMotorPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitMotorPins(void)
{
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t M4_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin 36)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M4_DIR_GPIO, BOARD_INITMOTORPINS_M4_DIR_PORT, BOARD_INITMOTORPINS_M4_DIR_PIN, &M4_DIR_config);

    gpio_pin_config_t M2_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_4 (pin 6)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M2_DIR_GPIO, BOARD_INITMOTORPINS_M2_DIR_PORT, BOARD_INITMOTORPINS_M2_DIR_PIN, &M2_DIR_config);

    gpio_pin_config_t gpio0_pin0_6 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin )  */
    GPIO_PinInit(GPIO, 0U, 6U, &gpio0_pin0_6);

    gpio_pin_config_t gpio0_pin0_7 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin )  */
    GPIO_PinInit(GPIO, 0U, 7U, &gpio0_pin0_7);

    gpio_pin_config_t gpio0_pin0_8 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin )  */
    GPIO_PinInit(GPIO, 0U, 8U, &gpio0_pin0_8);

    gpio_pin_config_t gpio0_pin0_9 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin )  */
    GPIO_PinInit(GPIO, 0U, 9U, &gpio0_pin0_9);

    gpio_pin_config_t M0_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin 4)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M0_STEP_GPIO, BOARD_INITMOTORPINS_M0_STEP_PORT, BOARD_INITMOTORPINS_M0_STEP_PIN, &M0_STEP_config);

    gpio_pin_config_t M1_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin 2)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M1_DIR_GPIO, BOARD_INITMOTORPINS_M1_DIR_PORT, BOARD_INITMOTORPINS_M1_DIR_PIN, &M1_DIR_config);

    gpio_pin_config_t M3_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 18)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M3_STEP_GPIO, BOARD_INITMOTORPINS_M3_STEP_PORT, BOARD_INITMOTORPINS_M3_STEP_PIN, &M3_STEP_config);

    gpio_pin_config_t M3_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_27 (pin 17)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M3_DIR_GPIO, BOARD_INITMOTORPINS_M3_DIR_PORT, BOARD_INITMOTORPINS_M3_DIR_PIN, &M3_DIR_config);

    gpio_pin_config_t M2_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin 7)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M2_STEP_GPIO, BOARD_INITMOTORPINS_M2_STEP_PORT, BOARD_INITMOTORPINS_M2_STEP_PIN, &M2_STEP_config);

    gpio_pin_config_t gpio1_pin1_5 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_5 (pin )  */
    GPIO_PinInit(GPIO, 1U, 5U, &gpio1_pin1_5);

    gpio_pin_config_t gpio1_pin1_6 = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin )  */
    GPIO_PinInit(GPIO, 1U, 6U, &gpio1_pin1_6);

    gpio_pin_config_t M4_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin 35)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M4_STEP_GPIO, BOARD_INITMOTORPINS_M4_STEP_PORT, BOARD_INITMOTORPINS_M4_STEP_PIN, &M4_STEP_config);

    gpio_pin_config_t M1_STEP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_8 (pin 1)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M1_STEP_GPIO, BOARD_INITMOTORPINS_M1_STEP_PORT, BOARD_INITMOTORPINS_M1_STEP_PIN, &M1_STEP_config);

    gpio_pin_config_t M0_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_9 (pin 3)  */
    GPIO_PinInit(BOARD_INITMOTORPINS_M0_DIR_GPIO, BOARD_INITMOTORPINS_M0_DIR_PORT, BOARD_INITMOTORPINS_M0_DIR_PIN, &M0_DIR_config);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitRS485:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '23', peripheral: USART0, signal: RTS, pin_signal: PIO1_4/CAPT_X5, direction: OUTPUT}
  - {pin_num: '22', peripheral: USART0, signal: TXD, pin_signal: PIO0_15}
  - {pin_num: '24', peripheral: USART0, signal: RXD, pin_signal: PIO0_1/ACMP_I2/CLKIN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitRS485
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitRS485(void)
{
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    /* USART0_TXD connect to P0_15 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART0_TXD, kSWM_PortPin_P0_15);

    /* USART0_RXD connect to P0_1 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART0_RXD, kSWM_PortPin_P0_1);

    /* USART0_RTS connect to P1_4 */
    SWM_SetMovablePinSelect(SWM0, kSWM_USART0_RTS, kSWM_PortPin_P1_4);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
